---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs
source: html/41983839-b932-1b31-d0d8-913fa9d7fd8a.htm
---
# DocumentSynchronizingWithCentralEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.